app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-01-24 19:08:35.358055"], ["id", 1]]
---
  def update
   article = Article.find_by_id(params[:id])
   article.update(params.require(:article).permit(:title, :description))